import Treasure.ConsoleMenu;

import java.io.FileNotFoundException;

public class CLS {
    public static void main(String[] args) throws FileNotFoundException {

        // Task 4. Создать консольное приложение, удовлетворяющее следующим требованиям:
        // - Приложение должно быть объектно-, а не процедурно-ориентированным.
        // - Каждый клаас должен иметь отражающее смысл название и информативный состав.
        // - Наследование должно применяться только тогда, когда это имеет смысл.
        // - При кодировании должны быть использованы соглашения об оформлении кода java code convention.
        // - Классы должны быть грамотно разложены по пакетам.
        // - Консольное меню должно быть минимальным.
        // - Для хранения данных можно использовать файлы.
        //
        // Дракон и его сокровища: Создать программу, позволяющую обрабатывать
        // сведения о 100 сокровищах в пещере дракона. Реализовать возможность просмотра сокровищ,
        // выбор самого дорогого по стоимости сокровища и выбора сокровищ на заданную сумму.

        ConsoleMenu consoleMenu = new ConsoleMenu();
    }
}